[
    {
      "estate_title": "Modern Single-Family Home",
      "id": 1,
      "segment_name": "Single Family",
      "description": "A beautiful modern single-family home located in a quiet neighborhood.",
      "price": "$500,000",
      "status": "sale",
      "area": "2500 sq ft",
      "location": "Anytown, USA",
      "details_location": "123 Main Street, Anytown, USA",
      "facilities": ["Living Room", "Kitchen", "Backyard", "Garage"],
      "bedrooms": 4,
      "bathrooms": 3,
      "image_url": "https://i.ibb.co/HKWvzh4/modernsingle.jpg",
      "accessibility_features": ["Wheelchair Ramp", "Wide Doorways"],
      "nearby_attractions": ["Parks", "Schools", "Shopping Centers"],
      "additional_details": "This modern single-family home presents an ideal blend of contemporary aesthetics and comfort, nestled in a serene neighborhood of Anytown, USA. Boasting 4 bedrooms and 3 bathrooms spread across 2500 square feet, this residence offers ample space for families to thrive. Built in 2018, the property features a spacious living room, a fully equipped kitchen, a tranquil backyard, and a convenient garage. Accessibility is ensured with wheelchair ramps and wide doorways, catering to diverse needs. Pet-friendly and proximate to parks, schools, and shopping centers, it embodies the essence of suburban living at its finest.",
      "agent": {
        "name": "Sarah Ali",
        "image": "https://i.ibb.co/cJ85JK3/6-63.jpg",
        "details": "Sarah Ali is a licensed real estate agent with over 10 years of experience in the Anytown area. He specializes in helping families find their dream homes."
      }
    },
    {
      "estate_title": "Luxury Apartment",
      "id": 2,
      "segment_name": "Apartment",
      "description": "A luxurious apartment with stunning city views.",
      "price": "$2,500/month",
      "status": "rent",
      "area": "1200 sq ft",
      "location": "Metropolis, USA",
      "details_location": "456 High Street, Metropolis, USA",
      "facilities": ["Swimming Pool", "Gym", "Security", "Parking"],
      "bedrooms": 2,
      "bathrooms": 2,
      "image_url": "https://i.ibb.co/Gvk2Ftk/luxury-apartments.jpg",
      "accessibility_features": [],
      "nearby_attractions": ["Restaurants","Parks", "Public Transportation"],
      "additional_details": "Welcome to the epitome of urban luxury living in the heart of Metropolis, USA. This exquisite apartment offers breathtaking city views and indulgent amenities. With 2 bedrooms, 2 bathrooms, and 1200 square feet of lavish space, residents can relish in comfort and sophistication. Facilities include a refreshing swimming pool, a state-of-the-art gym, round-the-clock security, and convenient parking. While pets aren't accommodated, residents enjoy easy access to fine dining, parks, and public transportation, enriching their metropolitan lifestyle.",
      "agent": {
        "name": "David Jhon",
        "image": "https://i.ibb.co/L9YVqwF/6-13.jpg",
        "details": "David Jhon is a dedicated real estate agent with a passion for helping clients find their perfect home in Metropolis. With her personalized approach and attention to detail, she ensures a smooth and enjoyable home-buying experience."
      }
    },
    {
      "estate_title": "Cozy Townhouse",
      "id": 3,
      "segment_name": "Townhouse",
      "description": "A charming townhouse with a fenced backyard, perfect for families.",
      "price": "$350,000",
      "status": "sale",
      "area": "1800 sq ft",
      "location": "Suburbia, USA",
      "details_location": "789 Elm Avenue, Suburbia, USA",
      "facilities": ["Living Room", "Kitchen", "Backyard", "Garage"],
      "bedrooms": 3,
      "bathrooms": 2,
      "image_url": "https://i.ibb.co/TqRXjgP/Townhouse.jpg",
      "accessibility_features": ["Wide Doorways"],
      "nearby_attractions": ["Playgrounds", "Schools", "Grocery Stores"],
      "additional_details": "Tucked away in the charming suburbia of USA, this cozy townhouse exudes warmth and family-friendly charm. Featuring 3 bedrooms, 2 bathrooms, and 1800 square feet of inviting space, it's the perfect sanctuary for creating lasting memories. The fenced backyard offers privacy and security, ideal for both relaxation and play. Complete with a garage, a living room, and a kitchen, this townhouse caters to everyday convenience. With wide doorways for accessibility and proximity to playgrounds, schools, and grocery stores, it's a haven for families seeking suburban bliss.",
      "agent": {
        "name": "Thomas Leroy",
        "image": "https://i.ibb.co/4MQkvBm/download.jpg",
        "details": "Thomas Leroy is a seasoned real estate agent specializing in suburban properties. With her extensive knowledge of the Suburbia area, she helps clients find their perfect home."
      }
    },
    {
      "estate_title": "Student Housing",
      "id": 4,
      "segment_name": "Student Housing",
      "description": "Spacious student housing with shared amenities and convenient location near campus.",
      "price": "$800/month/room",
      "status": "rent",
      "area": "120 sq ft (per room)",
      "location": "University Town, USA",
      "details_location": "101 College Road, University Town, USA",
      "facilities": ["Shared Kitchen", "Study Room", "Laundry Facilities"],
      "bedrooms": 4,
      "bathrooms": 2,
      "distance_to_campus": "0.5 miles",
      "image_url": "https://i.ibb.co/2PQq1DG/Student-Housing-Renovation-Clark-Nexsen-1200.jpg",
      "accessibility_features": [],
      "nearby_attractions": ["Campus Facilities", "Restaurants", "Public Transportation"],
      "additional_details": "Embrace the ultimate collegiate experience with this spacious student housing situated in the bustling University Town, USA. Designed for communal living, each of the 4 bedrooms comes with shared amenities, fostering a vibrant academic community. Residents benefit from a shared kitchen, study room, and laundry facilities, ensuring convenience and camaraderie. Just half a mile from campus facilities and surrounded by restaurants and public transportation, this accommodation offers both comfort and connectivity for students pursuing their academic journey.",
      "agent": {
        "name": "Alex Jenkins",
        "image": "https://i.ibb.co/x3vmhWZ/Alex.jpg",
        "details": "Alex Jenkins specializes in student housing in University Town, USA. With his knowledge of the local area and understanding of student needs, he helps students find the perfect accommodation for their college years."
      }
    },
    {
      "estate_title": "Senior Living Community",
      "id": 5,
      "segment_name": "Senior Living",
      "description": "A vibrant senior living community offering various activities and amenities for retirees.",
      "price": "$3,000/month",
      "status": "rent",
      "area": "500 sq ft ",
      "location": "Serenity City, USA",
      "details_location": "222 Peaceful Lane, Serenity City, USA",
      "facilities": ["Community Center", "Fitness Center", "Walking Trails"],
      "bathrooms": 1,
      "bedrooms": 1,
      "image_url": "https://i.ibb.co/nwcZvVw/senior.jpg",
      "accessibility_features": ["Wide Doorways", "Grab Bars in Bathrooms"],
      "nearby_attractions": ["Medical Facilities", "Parks", "Shopping Centers"],
      "additional_details": "Experience a fulfilling retirement lifestyle in the tranquil surroundings of Serenity City, USA. This vibrant senior living community offers a cozy studio apartment with 500 square feet of space, thoughtfully designed for comfort and accessibility. Residents enjoy a range of amenities including a community center, fitness center, and scenic walking trails, promoting active and engaging lifestyles. With wide doorways and grab bars in bathrooms for added safety, along with nearby medical facilities, parks, and shopping centers, this community fosters well-being and contentment for retirees.",
      "agent": {
        "name": "Emily Ken",
        "image": "https://i.ibb.co/mTBJZ82/6-57.jpg",
        "details": "Emily Ken specializes in senior living communities in Serenity City, USA. With her compassion and dedication, she helps retirees find a comfortable and enjoyable living environment for their golden years."
      }
    },
    {
      "estate_title": "Vacation Rental",
      "id": 6,
      "segment_name": "Vacation Rental",
      "description": "A cozy vacation rental perfect for a getaway, nestled in a scenic location.",
      "price": "$200/night",
      "status": "rent",
      "area": "1000 sq ft",
      "location": "Seaside Town, USA",
      "details_location": "777 Ocean View Drive, Seaside Town, USA",
      "facilities": ["Ocean View", "Outdoor Grill", "Fireplace"],
      "maximum_guests": 6,
      "minimum_stay_duration": 2,
      "bathrooms": 2,
      "bedrooms": 2,
      "image_url": "https://i.ibb.co/F01pYLB/vacational-rental.webp",
      "nearby_attractions": ["Beaches", "Restaurants", "Tourist Attractions"],
      "additional_details": "Escape to relaxation in this charming vacation rental nestled in the picturesque Seaside Town, USA. Boasting 2 bedrooms, 2 bathrooms, and 1000 square feet of coastal charm, it offers the perfect retreat for up to 6 guests. With ocean views, an outdoor grill, and a cozy fireplace, every moment promises tranquility and serenity. Pet-friendly and within proximity to beaches, restaurants, and tourist attractions, this rental invites guests to unwind and create cherished memories by the sea.",
      "agent": {
        "name": "Anjo Lebra",
        "image": "https://i.ibb.co/kB2PTry/images.jpg",
        "details": "Anjo Lebra specializes in vacation rentals in Seaside Town, USA. With his knowledge of the area and commitment to customer satisfaction, he helps guests find the perfect rental for their seaside getaway."
      }
    }
  ]